![alt text](image.png)

| Устройство  | Интерфейс   | IP-адрес / префикс |
| ------------- |:------------------:| -----:|
| S1     | VLAN 1    | 192.168.1.2 /24 |
| PC-A     | NIC     |   192.168.1.10 /24 |


# Часть 1. Создание сети и проверка настроек коммутатора по умолчанию 
В первой части лабораторной работы вам предстоит настроить топологию сети и проверить настройку коммутатора по умолчанию.
## Шаг 1. Создайте сеть согласно топологии.

Вопрос:
Почему нужно использовать консольное подключение для первоначальной настройки коммутатора? Почему нельзя подключиться к коммутатору через Telnet или SSH?

**Потому что нет преднастройки**

## Шаг 2. Проверьте настройки коммутатора по умолчанию.

b.	Изучите текущий файл running configuration.

Вопросы:

Сколько интерфейсов FastEthernet имеется на коммутаторе 2960?

**24**

Сколько интерфейсов Gigabit Ethernet имеется на коммутаторе 2960?

**2**

Каков диапазон значений, отображаемых в vty-линиях?

**0 -4  / 5-15**

c.	Изучите файл загрузочной конфигурации (startup configuration), который содержится в энергонезависимом ОЗУ (NVRAM).

**startup-config is not present**

Вопрос:
Почему появляется это сообщение?

**Потому что не было записи конфига**

d.	Изучите характеристики SVI для VLAN 1.

Вопросы:
Назначен ли IP-адрес сети VLAN 1?

**Нет**

Какой MAC-адрес имеет SVI? Возможны различные варианты ответов.

**00:0D:BD:CC:12:EC**

Данный интерфейс включен?

**Нет**

e.	Изучите IP-свойства интерфейса SVI сети VLAN 1.

Вопрос:
Какие выходные данные вы видите?

**Vlan1 отключен, line protocol отключен, internet protocol отключен**

f.	Подсоедините кабель Ethernet компьютера PC-A к порту 6 на коммутаторе и изучите IP-свойства интерфейса SVI сети VLAN 1. Дождитесь согласования параметров скорости и дуплекса между коммутатором и ПК.

Примечание. При использовании Netlab включите интерфейс F0/6 на коммутаторе S1.

Вопрос:
Какие выходные данные вы видите?

**Режим конфигурации интерфейса F0/6***

g.	Изучите сведения о версии ОС Cisco IOS на коммутаторе.

Вопросы:
Под управлением какой версии ОС Cisco IOS работает коммутатор?

**15.0(2)SE4**

Как называется файл образа системы?

**C2960-LANBASEK9-M**

h.	Изучите свойства по умолчанию интерфейса FastEthernet, который используется компьютером PC-A.

Switch# show interface f0/6 

Вопрос:
Интерфейс включен или выключен?

**включен**

Что нужно сделать, чтобы включить интерфейс?

**Воткнуть кабель (или команда no shutdown)**

Какой MAC-адрес у интерфейса?

**0010.1104.3706**

Какие настройки скорости и дуплекса заданы в интерфейсе?

**Full-duplex, 100mb/s**

i.	Изучите флеш-память.
Выполните одну из следующих команд, чтобы изучить содержимое флеш-каталога.

Switch# show flash 

Switch# dir flash:

В конце имени файла указано расширение, например .bin. Каталоги не имеют расширения файла.

Вопрос:
Какое имя присвоено образу Cisco IOS?

**2960-lanbasek9-mz.150-2.SE4.bin**

# Часть 2. Настройка базовых параметров сетевых устройств
Во второй части необходимо будет настроить основные параметры коммутатора и компьютера.
## Шаг 1. Настройте базовые параметры коммутатора.
a.	В режиме глобальной конфигурации скопируйте следующие базовые параметры конфигурации и вставьте их в файл на коммутаторе S1. 
```
no ip domain-lookup
hostname S1
service password-encryption
enable secret class
banner motd #
Unauthorized access is strictly prohibited. # 
```
b.	Назначьте IP-адрес интерфейсу SVI на коммутаторе. Благодаря этому вы получите возможность удаленного управления коммутатором.
Прежде чем вы сможете управлять коммутатором S1 удаленно с компьютера PC-A, коммутатору нужно назначить IP-адрес. Согласно конфигурации по умолчанию коммутатором можно управлять через VLAN 1.
```
S1(config)#interface vlan 1
S1(config-if)#ip address 192.168.1.2 255.255.255.0
 ```
c.	Доступ через порт консоли также следует ограничить  с помощью пароля. Используйте cisco в качестве пароля для входа в консоль в этом задании. Конфигурация по умолчанию разрешает все консольные подключения без пароля. Чтобы консольные сообщения не прерывали выполнение команд, используйте параметр logging synchronous.
```
S1(config)# line con 0
S1(config-line)#password cisco
S1(config-line)# logging synchronous 
```
d.	Настройте каналы виртуального соединения для удаленного управления (vty), чтобы коммутатор разрешил доступ через Telnet. Если не настроить пароль VTY, будет невозможно подключиться к коммутатору по протоколу Telnet.
```
S1(config-line)#line vty 0 4
S1(config-line)#password cisco
S1(config-line)#login
S1(config-line)#transport input telnet
```
Вопрос:
Для чего нужна команда login?

**Чтобы разрешить вход под указанным паролем**

## Шаг 2. Настройте IP-адрес на компьютере PC-A.
Назначьте компьютеру IP-адрес и маску подсети в соответствии с таблицей адресации.
1)	Перейдите в Панель управления. (Control Panel)
2)	В представлении «Категория» выберите « Просмотр состояния сети и задач».
3)	Щелкните Изменение параметров адаптера на левой панели.
4)	Щелкните правой кнопкой мыши интерфейс Ethernet и выберите «Свойства» .
5)	Выберите Протокол Интернета версии 4 (TCP/IPv4) > Свойства.
6)	Выберите Использовать следующий IP-адрес и введите IP-адрес и маску подсети  и нажмите ОК.
# Часть 3. Проверка сетевых подключений
В третьей части лабораторной работы вам предстоит проверить и задокументировать конфигурацию коммутатора, протестировать сквозное соединение между компьютером PC-A и коммутатором S1, а также протестировать возможность удаленного управления коммутатором.
## Шаг 1. Отобразите конфигурацию коммутатора.

Используйте консольное подключение на компьютере PC-A для отображения и проверки конфигурации коммутатора. Команда show run позволяет постранично отобразить всю текущую конфигурацию. Для пролистывания используйте клавишу пробела.


```
S1# show run
Building configuration...

Current configuration : 2206 bytes
!
version 15.2
no service pad
service timestamps debug datetime msec
service timestamps log datetime msec
service password-encryption
!
hostname S1
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$mtvC$6NC.1VKr3p6bj7YGE.jNg0
!
no aaa new-model
system mtu routing 1500 
!
!
no ip domain-lookup
!
<output omitted>
!
interface FastEthernet0/24
!
interface GigabitEthernet0/1
!
interface GigabitEthernet0/2
!
interface Vlan1
 ip address 192.168.1.2 255.255.255.0
!
ip default-gateway 192.168.1.1
ip http server
ip http secure-server
!
banner motd ^C
Unauthorized access is strictly prohibited. ^C
!
line con 0
 password 7 00071A150754
 logging synchronous
 login
line vty 0 4
 password 7 121A0C041104
 login
line vty 5 15
 password 7 121A0C041104
 login
!
end
```
b.	Проверьте параметры VLAN 1.
```
S1# show interface vlan 1 
```
Какова полоса пропускания этого интерфейса?

**BW 100000 Kbit**

# Вопросы для повторения
1.	Зачем необходимо настраивать пароль VTY для коммутатора?

**Для защиты своего подключения**

2.	Что нужно сделать, чтобы пароли не отправлялись в незашифрованном виде?

**надо использовать ssh**
